app/Http/Traits/GlobalTrait.php

select * from `users`
---
    public function getAllSettings()
    {
        // Fetch all the settings from the 'settings' table.
        $settings = User::all();