app/Http/Controllers/adminController.php

select * from `users` where `id` = 5 limit 1
select * from `users`
select * from `properties` where `id` = 1 limit 1
---
 public function index()
    {
//dd(request()->getHost());
      //dd(request()->segments());

       if(auth())
       {
        $now = Carbon::now();
        $weekStartDate = $now->startOfWeek()->format('Y-m-d H:i');
        $weekEndDate = $now->endOfWeek()->format('Y-m-d H:i');
        $user = User::where('id',auth()->id())->first();
        $users= User::get();
        $user->hasRole('Admin');
      $property_name = property::where('id',$user->property_id)->first();