app/Http/Controllers/ChecklistController.php

select * from `metanames` where `metanames`.`id` = 1 limit 1
---
       }

    //$metaname_id=$this->metaname_model;
    $metanamess = metaname::where('metanames.id',$metaname_id)->first();

select `metanames`.`id`, `metanames`.`metaname_name` from `metanames` inner join `qns_appliedtos` on `qns_appliedtos`.`metaname_id` = `metanames`.`id` where `qns_appliedtos`.`department_id` = 5 group by `metanames`.`id`
---
    //  ->groupby('metanames.id')
    //  ->get();

    $metanames = metaname::join('qns_appliedtos','qns_appliedtos.metaname_id','metanames.id')
     ->where('qns_appliedtos.department_id',$departments->department_id)
     ->select('metanames.id','metanames.metaname_name')
     ->groupby('metanames.id')
     ->get();

select `assets`.`id`, `assets`.`asset_name` from `assets` where `assets`.`metaname_id` = 1 and `assets`.`property_id` = 2
---
          $metadatasCollects = collect($metadatasCollects);
          //$subset = $metadatas->map->only(['id', 'name', 'email']);

      $assets = asset::where('assets.metaname_id',$metaname_id)
       ->where('assets.property_id',auth()->user()->property_id)
      ->select('assets.id','assets.asset_name')
      ->get();

update `assets` set `time_show` = 1, `asset_show` = 1, `assets`.`updated_at` = '2024-11-01 09:18:04' where `property_id` = 2
---
    }
    }
    else{
    $update = asset::where('property_id',$departments->property_id)->update([
      'time_show'=>1,
      'asset_show'=>1
    ]);