app/Http/Controllers/DailydutymanagerController.php

select * from `metanames` where `metanames`.`metaname_name` = 'Managers' limit 1
---
     public function index(Request $request)
    {

        //dd('print');
      $current_date = date('Y-m-d');
      //Extract date
      $datet=Carbon::now();

     // dd($current_date);

      $datet=$datet->format('H:i:s');
      //dd($departments->property_id);


       $metaname_id= metaname::where('metanames.metaname_name',"Managers")->first();

select * from `metanames` where `metanames`.`metaname_name` = 'Managers' limit 1
select * from `assets` where `assets`.`id` = 1 limit 1
---


    //$metaname_id=$this->metaname_model;
    $metanamess = metaname::where('metanames.metaname_name',"Managers")->first();
   $assetss = asset::where('assets.id',$assetID)->first();

select `metanames`.`id`, `metanames`.`metaname_name` from `metanames` inner join `qns_appliedtos` on `qns_appliedtos`.`metaname_id` = `metanames`.`id` where `qns_appliedtos`.`department_id` = 14 group by `metanames`.`id`
---

    $metanames = metaname::join('qns_appliedtos','qns_appliedtos.metaname_id','metanames.id')
      ->where('qns_appliedtos.department_id',$users->department_id)
    //->where('qns_appliedtos.department_id',14)
     ->select('metanames.id','metanames.metaname_name')
     ->groupby('metanames.id')
     ->get();

select `assets`.`id`, `assets`.`asset_name` from `assets` where `assets`.`asset_name` = 'Managers'
---
          $metadatasCollects = collect($metadatasCollects);
          //$subset = $metadatas->map->only(['id', 'name', 'email']);

      $assets = asset::where('assets.asset_name',"Managers")
      ->select('assets.id','assets.asset_name')
      ->get();

update `assets` set `time_show` = 1, `asset_show` = 1, `assets`.`updated_at` = '2024-07-10 10:09:44' where `property_id` = 1
---

    if($asset_show->asset_show==1 && $date_time>$datet && $date_time_init!="00:00:00")
    {
    $update = asset::where('property_id',$users->property_id)->update([
      'time_show'=>1,
      'asset_show'=>1,
    ]);