app/Http/Controllers/DailyController.php




      $assets = asset::where('assets.metaname_id',$metaname_id)
      ->where('assets.property_id',auth()->user()->property_id)
      ->select('assets.id','assets.asset_name','assets.property_id')
      ->get();
---
select `assets`.`id`, `assets`.`asset_name`, `assets`.`property_id` from `assets` where `assets`.`metaname_id` = 1 and `assets`.`property_id` = 2