app/Http/Controllers/DailydutymanagerController.php

select `assets`.`id`, `assets`.`asset_name` from `assets` where `assets`.`asset_name` = 'Managers' and `assets`.`property_id` = 1
---
          $metadatasCollects = collect($metadatasCollects);
          //$subset = $metadatas->map->only(['id', 'name', 'email']);

      $assets = asset::where('assets.asset_name',"Managers")
      ->where('assets.property_id',auth()->user()->property_id)
      ->select('assets.id','assets.asset_name')
      ->get();