app/Http/Controllers/ManageController.php

select * from `departments` where `status` = 'Active' and `id` = 14 limit 1
select `assets`.`id`, `assets`.`metaname_id`, `assets`.`asset_name` from `assets` inner join `answers` on `answers`.`asset_id` = `assets`.`id` where `assets`.`metaname_id` = 1 and `answers`.`manager_checklist` != 'Cleared' group by `assets`.`asset_name`
select `metanames`.`id`, `metanames`.`metaname_name` from `user_activities` inner join `metanames` on `metanames`.`id` = `user_activities`.`activity_id` where `user_activities`.`sys_user_id` = 5 and `user_activities`.`status` = 'Active'
---
      //Assign Activities to userActivities
      $departments=user::where('id',auth()->id())->first();
      //Get Department name
        $departGetName= department::where('status','Active')
        ->where('id',$departments->department_id)->first();
      //dd($departGetName);

      //$assets = asset::where('assets.metaname_id',$metaname_id)
     $assets = asset::join('answers','answers.asset_id','assets.id')
     ->where('assets.metaname_id',$metaname_id)
     ->where('answers.manager_checklist','!=',"Cleared")
     ->groupby('assets.asset_name')
    ->select('assets.id','assets.asset_name')
      ->get();
//dd($assets);

      $userMetanames = userActivity::join('metanames','metanames.id','user_activities.activity_id')
      ->where('user_activities.sys_user_id',auth()->id())
      ->where('user_activities.status','Active')
      ->select('metanames.id','metanames.metaname_name')
      ->get();

select `metanames`.`id`, `metanames`.`metaname_name` from `user_activities` inner join `metanames` on `metanames`.`id` = `user_activities`.`activity_id` where `user_activities`.`sys_user_id` = 5 and `user_activities`.`status` = 'Active'
---
        $userActitivities = userActivity::join('metanames','metanames.id','user_activities.activity_id')
        ->where('user_activities.sys_user_id',auth()->id())
        ->where('user_activities.status','Active')
        //->join('users','sales.user_id','users.id')
        ->select('metanames.id','metanames.metaname_name')
        ->get();

select `metanames`.`id`, `metanames`.`metaname_name` from `user_roles` inner join `activity_roles` on `activity_roles`.`role_id` = `user_roles`.`role_id` inner join `metanames` on `metanames`.`id` = `activity_roles`.`activity_id` where `user_roles`.`sys_user_id` = 5 and `activity_roles`.`status` = 'Active'
select `metanames`.`id`, `metanames`.`metaname_name` from `department_roles` inner join `activity_roles` on `activity_roles`.`role_id` = `department_roles`.`role_id` inner join `metanames` on `metanames`.`id` = `activity_roles`.`activity_id` where `department_roles`.`department_id` = 14 and `activity_roles`.`status` = 'Active'
---
        ->join('metanames','metanames.id','activity_roles.activity_id')
        ->where('user_roles.sys_user_id',auth()->id())
       ->where('activity_roles.status','Active')
        //->join('users','sales.user_id','users.id')
       ->select('metanames.id','metanames.metaname_name')
        ->get();

        $userActitivitiesff = departmentRole::join('activity_roles','activity_roles.role_id','department_roles.role_id')
        ->join('metanames','metanames.id','activity_roles.activity_id')
        ->where('department_roles.department_id',$departments->department_id)
       ->where('activity_roles.status','Active')
       ->select('metanames.id','metanames.metaname_name')
        ->get();

update `assets` set `time_show` = 1, `asset_show` = 1, `assets`.`updated_at` = '2024-11-06 11:34:56' where `property_id` = 1
select `assets`.`id`, `assets`.`property_id`, `assets`.`metaname_id`, `assets`.`asset_name` from `assets` where `assets`.`status` = 'Active' and `assets`.`time_show` = 1 and `assets`.`id` is null and `assets`.`asset_name` != '' and `assets`.`property_id` = 1 and `assets`.`metaname_id` in (1) order by `assets`.`id` asc
---
        }
      }
      else{
          $update = asset::where('property_id',$departments->property_id)->update([
            'time_show'=>1,
            'asset_show'=>1
        ]);
      }
//$assetID
//dd(request('asset_model'));
       $pp = asset::where('assets.status','Active')
       ->where('assets.time_show',1)
         ->where('assets.id',request('asset_model'))
         ->where('assets.asset_name','!=',"")
         ->where('assets.property_id',$departments->property_id)
         ->whereIn('assets.metaname_id',[$metaname_id])
         ->select('assets.id','assets.property_id','assets.metaname_id','assets.asset_name')
         ->orderBy('assets.id')->get();

select * from `qns_appliedtos` where `qns_appliedtos`.`status` = 'Active' group by `qns_appliedtos`.`metaname_id`, `qns_appliedtos`.`section`
---
          $qns=collect($qns);

             //dd($qns);
          $sections=qnsAppliedto::where('qns_appliedtos.status','Active')
          ->groupby('qns_appliedtos.metaname_id')
          ->groupby('qns_appliedtos.section')
          ->get();

select * from `answers` where `answer` != 'Yes' and `manager_checklist` != 'Cleared' and `property_id` = 1 and `status` = 'Active'
select * from `metanames` where `metanames`.`id` = '1' limit 1
---
      $property_id=$departments->property_id;
      $metanameCollects=collect($metanames);
      //Count Questions
      $qnsCount=answer::where('answer','!=','Yes')
      ->where('manager_checklist','!=','Cleared')
      ->where('property_id',$departments->property_id)
       ->where('status','Active')
      ->get();

//dd(request('metaname_model'));
    $metanamess = metaname::where('metanames.id',$metaname_id)->first();

insert into `managers` (`property_id`, `metaname_id`, `asset_id`, `answer_id`, `indicator_id`, `section`, `cleared_date`, `datex`, `opt_answer_id`, `manager_checklist`, `status`, `action`, `user_id`, `updated_at`, `created_at`) values ('1', '1', '7', '10', '3', '', '2024-11-05', '2024-11-05', '9', 'Cleared', 'Active', 1, 5, '2024-11-05 22:05:55', '2024-11-05 22:05:55')
---
     //Unset the idx
     if($nameStr===$idxKey)
      {
       $insetqnsAns = manager::UpdateOrCreate([
         'property_id'=>$property_id,
         'metaname_id'=>$data[2],
          'asset_id'=>$asset_id,
          'answer_id'=>$data[1],
          'indicator_id'=>$data[4],
          'section'=>$section,
          'cleared_date'=>$current_date,
         'datex'=>$current_date,

       ],[
         'opt_answer_id'=>$data[3],
         'manager_checklist'=>$value[0],
         'status'=>'Active',
         'action'=>1,
         'user_id'=>auth()->id(),
       ]);