app/Http/Controllers/PropertyController.php

select * from `properties` where `id` = 1 limit 1
---
 public function reportGeneral(Request $request,$id)
    {
$prnt="";
$userID=user::where('id',auth()->id())->first();
$property=property::where('id',$userID->property_id)->first();