app/Providers/AppServiceProvider.php

select * from `users`
select `properties`.`property_name` from `users` inner join `properties` on `users`.`property_id` = `properties`.`id` limit 1
select * from `answers` where `answer` != 'Yes' and `manager_checklist` != 'Cleared' and `property_id` = 1 and `status` = 'Active'
---
    public function boot()
    {
      $userCount=0;


         // Using view composer to set following variables globally
           view()->composer('*',function($view) {

  $view->with('userCount', Auth::user());
  //dd($view->userCount;

             if($view->userCount !=NULL)
             {
               $property_id=Auth::user()->property_id;
             }
             else {
               $property_id=0;
             }

            $view->with('user', Auth::user());
            $view->with('userx', User::all());
            $view->with('qnsCountx', User::join('properties','users.property_id','properties.id')
            ->select('properties.property_name')->first());

            $view->with('qnsCount', answer::where('answer','!=','Yes')
            ->where('manager_checklist','!=','Cleared')
            ->where('property_id',$property_id)
             ->where('status','Active')
            ->get());

select * from `my_companies` where `status` = 'Active' limit 1
---
            //->select('properties.property_name')->first());
             //$view->with('qnsCount', collect($qnsCount));

             $view->with('company', myCompany::where('status','Active')->first());
        });